N10 R1=74                 ;длина детали
N20 R2=3+0.5              ;ширина резца + припуск на подрезку торца
N30 R3=15                 ;мин. длина прутка в цанге
N40 R6=13                 ;длина прутка от цанги
N50 R5=R1+R2              ;длина отрезки
N60 R4=R3+R6+R5           ;мин.остаток прутка
N70 GOTOF N240             ;переход на кадр 240
N80 R0=R0-R5
N90 IF R0<R4 GOTOF N1790   ;переход на подготовку новой детали
N100 T8 M20                ;вытягивающаяя цанга и вкл.шнек  
N110 G0 X0                ;быстрый ход в указанные координаты 
N120 Z25
N130 Z14
N140 G1 G94 Z0 F5000      ;на подаче ехать в Z0
N150 M81                  ;разжать патрон
N160 G4 F3                ;G4-выдержка времени, F3-3секунды
N170 G0 Z=R1+R2           ;вытянуть пруток на длину, равную длине отрезки
N180 M84                  ;зажать патрон
N190 G4 F3
N200 G0 Z100
N210 X200
N220 R0=1500   ;длина нового прутка,забивается в offset   R-параметры   R0=?


N230 T1D2      ;Т1 кромка 2(D2)
N240 G0 X0
N250 Z0
N260 M0        ;технологический останов(разжать патрон,вытащить пруток,зажать патрон)
N270 G0 Z50
N280 X200


N290 G1
N300 TRANS X0 Z0


N310 T1       ;РЕЗЕЦ1
N320 G97
N330 S2000 M3
N340 G0 X374 Z107.3
N350 G1 G95 X146.2 F0.3
N360 G0 X600 Z900
N370 M1


N380 T2       ;CH
N390 G97
N400 S2000 M3
N410 X373.858 Z107
N420 G1 X147.942 F0.2
N430 G0 X600 Z900
N440 M1


N450 T3       ;RAST
N460 G97
N470 S3000 M3
N480 X73
N490 Z73
N500 G1 X136.32 F0.3
N510 Z75.514
N520 G0 X142.32 Z76.309
N530 G1 Z73.186
N540 X140.32 Z74.186
N550 G0 Z78.324
N560 G1 X148.32
N570 Z74.424
N580 X146.32 Z75.424
N590 G0 Z108
N600 G1 X154.32
N610 Z77.726
N620 X152.32 Z78.726
N630 G0 Z108
N640 G1 X158.022
N650 Z98.539
N660 X156.32 Z97.687
N670 Z81.8
N680 G3 X138.72 Z73 CR=8.8
N690 G1 X136.32
N700 X134.32 Z74
N710 G0 X156.022 Z105
N720 G1 X193.14
N730 X191.14 Z106
N740 G0 X156.022
N750 G1 Z103
N760 X193.14
N770 X191.14 Z104
N780 G0 X156.022
N790 G1 Z101
N800 X193.14
N810 X191.14 Z102
N820 G0 X156.022
N830 G1 Z99.19
N840 X193.14
N850 Z105.202
N860 X196.37 Z108
N870 G0 X73
N880 Z71
N890 G1 X117.44
N900 X115.44 Z72
N910 G0 X73
N920 G1 Z69
N930 X117.44
N940 X115.44 Z70
N950 G0 X73
N960 G1 Z67.77
N970 X117.44
N980 Z71.797
N990 X121.846 Z74
N1000 G0 X78.014
N1010 Z68.77
N1020 G1 Z14.113
N1030 X73
N1040 G0 Z900
N1050 X600


N1060 R10=R10+1            ;R10-счётчик деталей 
N1070 M99                  ;вкл. счётчик
N1080 GOTOB N80      ;переход на кадр 80 
N1090 M81 T8         ;Т8 и разжать патрон 
N1100 M0             ;технологический останов - вытащить остаток прутка
N1110 G0 X90 Z2.6
N1120 M0             ;технологический останов - вставить новый пруток
N1130 M84            ;зажать
N1140 G0 Z50
N1150 M99            ;выкл. счётчик
N1160 GOTOB N90      ;переход на кадр 90
