N10 R1=74                 ;длина детали
N20 R2=3+0.5              ;ширина резца + припуск на подрезку торца
N30 R3=15                 ;мин. длина прутка в цанге
N40 R6=13                 ;длина прутка от цанги
N50 R5=R1+R2              ;длина отрезки
N60 R4=R3+R6+R5           ;мин.остаток прутка
N70 GOTOF N240             ;переход на кадр 240
N80 R0=R0-R5
N90 IF R0<R4 GOTOF N1790   ;переход на подготовку новой детали
N100 T8 M20                ;вытягивающаяя цанга и вкл.шнек  
N110 G0 X0                ;быстрый ход в указанные координаты 
N120 Z25
N130 Z14
N140 G1 G94 Z0 F5000      ;на подаче ехать в Z0
N150 M81                  ;разжать патрон
N160 G4 F3                ;G4-выдержка времени, F3-3секунды
N170 G0 Z=R1+R2           ;вытянуть пруток на длину, равную длине отрезки
N180 M84                  ;зажать патрон
N190 G4 F3
N200 G0 Z100
N210 X200
N220 R0=1500   ;длина нового прутка,забивается в offset   R-параметры   R0=?


N230 T1D2      ;Т1 кромка 2(D2)
N240 G0 X0
N250 Z0
N260 M0        ;технологический останов(разжать патрон,вытащить пруток,зажать патрон)
N270 G0 Z50
N280 X200


N290 G1
N300 TRANS X0 Z0


N310 T1       ;РЕЗЕЦ1
N320 G97
N330 S200 M3
N340 G0 X349 Z23
N350 G1 G95 X271.2 F0.3
N360 X273.2 Z24
N370 G0 X349
N380 G1 Z21
N390 X271.2
N400 G0 Z22
N410 X342.576
N420 G1 X345 Z20.788
N430 Z-3.391
N440 G0 X349
N450 Z22
N460 X339.182
N470 G1 X342.6 Z20.291
N480 Z-3.4
N490 G0 X349
N500 Z22
N510 X335.788
N520 G1 X340.2 Z19.794
N530 Z-3.4
N540 G0 X349
N550 Z22
N560 X332.394
N570 G1 X337.8 Z19.297
N580 Z-3.4
N590 G0 X376.586
N600 Z44.541


N610 T2       ;РЕЗЕЦ2
N620 G97
N630 S113 M3
N640 X284.164 Z22
N650 G1 X276 Z17.918 F0.35 M8
N660 G0 Z22
N670 X286.406
N680 G1 Z21
N690 X278 Z16.797
N700 X276
N710 G0 Z44.541 M9
N720 X376.586


N730 R10=R10+1            ;R10-счётчик деталей 
N740 M99                  ;вкл. счётчик
N750 GOTOB N80      ;переход на кадр 80 
N760 M81 T8         ;Т8 и разжать патрон 
N770 M0             ;технологический останов - вытащить остаток прутка
N780 G0 X90 Z2.6
N790 M0             ;технологический останов - вставить новый пруток
N800 M84            ;зажать
N810 G0 Z50
N820 M99            ;выкл. счётчик
N830 GOTOB N90      ;переход на кадр 90
