N10 R1=74                 ;длина детали
N20 R2=3+0.5              ;ширина резца + припуск на подрезку торца
N30 R3=15                 ;мин. длина прутка в цанге
N40 R6=13                 ;длина прутка от цанги
N50 R5=R1+R2              ;длина отрезки
N60 R4=R3+R6+R5           ;мин.остаток прутка
N70 GOTOF N240             ;переход на кадр 240
N80 R0=R0-R5
N90 IF R0<R4 GOTOF N1790   ;переход на подготовку новой детали
N100 T8 M20                ;вытягивающаяя цанга и вкл.шнек  
N110 G0 X0                ;быстрый ход в указанные координаты 
N120 Z25
N130 Z14
N140 G1 G94 Z0 F5000      ;на подаче ехать в Z0
N150 M81                  ;разжать патрон
N160 G4 F3                ;G4-выдержка времени, F3-3секунды
N170 G0 Z=R1+R2           ;вытянуть пруток на длину, равную длине отрезки
N180 M84                  ;зажать патрон
N190 G4 F3
N200 G0 Z100
N210 X200
N220 R0=1500   ;длина нового прутка,забивается в offset   R-параметры   R0=?


N230 T1D2      ;Т1 кромка 2(D2)
N240 G0 X0
N250 Z0
N260 M0        ;технологический останов(разжать патрон,вытащить пруток,зажать патрон)
N270 G0 Z50
N280 X200




N290 T1       ;РЕЗЕЦ1
N300 G1
N310 TRANS X0 Z0
N320 G97
N330 S150 M3
N340 G0 X339.8 Z19
N350 G1 G95 X271.2 F0.35 M8
N360 X273.2 Z20
N370 G0 X339.8
N380 G1 Z17
N390 X271.2
N400 X273.2 Z18
N410 G0 X339.8
N420 G1 Z15
N430 X271.2
N440 X273.2 Z16
N450 G0 X339.8
N460 G1 Z13
N470 X331.694
N480 X333.694 Z14
N490 G0 X339.8
N500 G1 Z11
N510 X335.694
N520 X337.694 Z12
N530 G0 X339.8
N540 Z8.947
N550 G1 X331.594 Z13.05
N560 X271.2
N570 G0 Z30 M9
N580 X350
N590 M1


N600 T2       ;РЕЗЕЦ2
N610 G97
N620 S150 M3
N630 X279.6 Z14.013
N640 G1 Z-3.4 M8
N650 X277.6 Z-2.4
N660 G0 Z14.05
N670 G1 X281.2
N680 Z-3.4
N690 X279.2 Z-2.4
N700 G0 Z14.05
N710 G1 X282.8
N720 Z-3.4
N730 X280.8 Z-2.4
N740 G0 Z14.05
N750 G1 X284.4
N760 Z-3.4
N770 X282.4 Z-2.4
N780 G0 Z14.05
N790 G1 X286
N800 Z-3.4
N810 X284 Z-2.4
N820 G0 Z14.05
N830 G1 X287.6
N840 Z-3.4
N850 X285.6 Z-2.4
N860 G0 Z13.82
N870 G1 X288.04
N880 Z-3.17
N890 G0 X286.04 M9
N900 Z30
N910 X350
N920 M1


N930 T3       ;РЕЗЕЦ3
N940 G97
N950 S200 M3
N960 X289.04 Z14.025
N970 G1 Z-2.575 M8
N980 M1
N990 G97
N1000 S200
N1010 G0 X287.04
N1020 Z14.05
N1030 X294.378
N1040 G1 X290.04 Z11.881 F0.2
N1050 Z-2.575
N1060 M1
N1070 G97
N1080 S200
N1090 G0 X288.04 M9
N1100 Z30
N1110 X350


N1120 R10=R10+1            ;R10-счётчик деталей 
N1130 M99                  ;вкл. счётчик
N1140 GOTOB N80      ;переход на кадр 80 
N1150 M81 T8         ;Т8 и разжать патрон 
N1160 M0             ;технологический останов - вытащить остаток прутка
N1170 G0 X90 Z2.6
N1180 M0             ;технологический останов - вставить новый пруток
N1190 M84            ;зажать
N1200 G0 Z50
N1210 M99            ;выкл. счётчик
N1220 GOTOB N90      ;переход на кадр 90
